In [1]:
%matplotlib widget

In [2]:
from credentials import postgres_username, postgres_password

In [3]:
import pandas as pd
import psycopg2
import sqlalchemy as db
import matplotlib.pyplot as plt
import numpy as np
import random

In [4]:
from sqlalchemy import create_engine
engine = db.create_engine(f"postgresql://{postgres_username}:{postgres_password}@localhost:5432/employee_db")
connection = engine.connect()

In [5]:
# Query salary table to retrieve salary data for histogram
salary_data = pd.read_sql('select * from salaries', connection)
salary_data

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]

In [6]:
# Create a histogram to visualize the most common salary ranges for employees.
plt.figure(figsize=(6,4))
plt.hist(salary_data["salary"],bins=10,color='#86bf91')
plt.xlim(35000,115000)
plt.title("Frequency distribution of employee salaries")
plt.xlabel("Salary ($)")
plt.ylabel("Number of employees")
plt.grid(axis='y', alpha=0.25)
plt.tight_layout()
plt.savefig("../Images/salary distribution")
plt.show

Canvas(toolbar=Toolbar(toolitems=[('Home', 'Reset original view', 'home', 'home'), ('Back', 'Back to previous …

In [7]:
# Create a DataFrame with title ID, title and average salary for bar chart
# In SQL, join employees, salaries and titles table and group by title, aggregate by salary (average)
title_salary_df = pd.read_sql_query("""select e.emp_title_id as "Title ID", t.title as "Title", round(avg(s.salary),2) as 
"Average salary"
from employees as e
inner join salaries as s
on e.emp_no=s.emp_no
inner join titles as t
on e.emp_title_id=t.title_id
group by e.emp_title_id, t.title
order by emp_title_id asc;""", connection)
title_salary_df

  Title ID               Title  Average salary
0    e0001  Assistant Engineer        48564.43
1    e0002            Engineer        48535.34
2    e0003     Senior Engineer        48506.80
3    e0004    Technique Leader        48582.90
4    m0001             Manager        51531.04
5    s0001               Staff        58465.38
6    s0002        Senior Staff        58550.17

In [8]:
# Create variables to hold average salary and titles data
ave_salary = title_salary_df["Average salary"]
titles = title_salary_df["Title"]

In [9]:
# Create a bar chart of average salary by title
x_axis = np.arange(len(title_salary_df["Title"]))
x_axis
plt.figure(figsize=(5,4))
plt.bar(x_axis, ave_salary, color='sandybrown', align="center", width=0.75)
tick_locations = [value for value in x_axis]
plt.xticks(tick_locations, titles, rotation=90);
plt.tick_params(bottom=False)
plt.ylim(0, 60000)
plt.title("Average salary by employee title")
plt.ylabel("Average salary ($)")
plt.grid(axis='y', alpha=0.25)
plt.tight_layout()
plt.savefig("../Images/average salary by title")
plt.show()

Canvas(toolbar=Toolbar(toolitems=[('Home', 'Reset original view', 'home', 'home'), ('Back', 'Back to previous …

In [10]:
# Search my ID number

my_info = pd.read_sql_query("select * from employees where emp_no = 499942", connection)
my_info

   emp_no emp_title_id  birth_date first_name last_name sex   hire_date
0  499942        e0004  1963-01-10      April  Foolsday   F  1997-02-10

In [11]:
my_first_name = my_info.loc[0, "first_name"]
my_last_name = my_info.loc[0, "last_name"]
props = dict(boxstyle='sawtooth', pad=0.5, facecolor='hotpink', alpha=0.5)
plt.figure(figsize=(2,1))
plt.figtext(0.5, 0.5, f"{my_first_name} {my_last_name}", horizontalalignment='center', verticalalignment='center', fontsize=15,bbox=props)
plt.savefig("../Images/april foolsday")
plt.show()

Canvas(toolbar=Toolbar(toolitems=[('Home', 'Reset original view', 'home', 'home'), ('Back', 'Back to previous …